mbardwell/rstrap/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_nus/Src/main.c
static void TensionLevelUpdate(void)
{
    ret_code_t err_code;
    uint32_t tension_level;
    // largest value to be sent is 2^23 = 8388608, which is 7 bytes. Add one for EOL character
    static uint32_t max_n_digits = 8;
    uint8_t tension[max_n_digits];
    uint16_t len;

    if (simEnabled)
    {
        tension_level = sensorsim_measure(&m_tension_sim_state, &m_tension_sim_cfg);
        len = uint32_encode(tension_level, tension);
        NRF_LOG_INFO("Sending tension measurement: %d", *tension);

        err_code = ble_nus_data_send(&m_nus, tension, &len, m_conn_handle);
        if (err_code != NRF_ERROR_INVALID_STATE) // TODO: remove this quick fix (used in other send functions too)
        {
            APP_ERROR_CHECK(err_code);
        }
    }
    else
    {
        if (Hx711SampleConvert(&tension_level) == NRFX_SUCCESS)
        {
            len = (uint16_t) max_n_digits;
            __itoa(tension_level, (char*) tension, 10);
            NRF_LOG_INFO("Sending tension measurement: %d of length: %d", tension_level, len);

            err_code = ble_nus_data_send(&m_nus, tension, &len, m_conn_handle);
            if (err_code != NRF_ERROR_INVALID_STATE) // TODO: remove this quick fix (used in other send functions too)
            {
                APP_ERROR_CHECK(err_code);
            }
        }
    }
}

/**@brief Function for sending a battery measurement over nus service
 */
static void nus_update_battery_voltage(void)
{
    int16_t voltage;
    static uint16_t max_n_ascii_characters = 1+4; // Byte order: nus tag, four digits for milli-voltage
    uint8_t voltage_in_ascii[max_n_ascii_characters];

    battery_level_in_mv(&voltage);
    NRF_LOG_INFO("Sending battery voltage in mV: %d", voltage);

    if (voltage > 9999 || voltage < 1000)
    {
        NRF_LOG_WARNING("Voltage outside of 4 digit bound. Not sent over nus");
        return;
    }

    voltage_in_ascii[0] = NUS_BATTERY_TAG;
    __itoa(voltage, (char*) voltage_in_ascii+1, 10);
    send_over_nus(voltage_in_ascii, &max_n_ascii_characters);
}

/**@brief Function for sending one temperature measurement over nus service.
 */
static void nus_update_temperature(void)
{
    static int32_t temperature;
    static uint8_t sign = 0x2B; // sign is default + in ascii
    static uint16_t max_n_ascii_characters = 1+1+2; // Byte order: nus tag, sign (+/-), two digits for temperature
    uint8_t temperature_in_ascii[max_n_ascii_characters];

    temperature_sample(&temperature); // returns temperature in celcius
    NRF_LOG_INFO("Sending temperature measurement: %d", temperature);
    if (temperature > 99 || temperature < -99)
    {
        NRF_LOG_WARNING("Temperature exceeds two-digit bound. Not sent over nus");
        return;
    }
    else if (temperature < 0)
    {
        sign = 0x2D;
        temperature = abs(temperature);
    }
    
    temperature_in_ascii[0] = NUS_TEMP_TAG;
    temperature_in_ascii[1] = sign;
    __itoa(temperature, (char*) temperature_in_ascii+2, 10);
    send_over_nus(temperature_in_ascii, &max_n_ascii_characters);
}

/**@brief Functions for handling the timer timeouts.
 *
 * @details This function will be called each time a timer expires.
 *
 * @param[in] p_context   Pointer used for passing some arbitrary information (context) from the
 *                        app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update_flag = true;
}

static void tension_timer_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    tension_level_update_flag = true;
}

static void temp_timer_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    temp_level_update_flag = true;
    accel_level_update_flag = true;
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    ret_code_t err_code;

    // Initialize timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_tension_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                tension_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_temp_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                temp_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t err_code;
    ble_gap_conn_params_t gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_THERMOMETER);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t *p_gatt, nrf_ble_gatt_evt_t const *p_evt)
{
    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }
    NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                  p_gatt->att_mtu_desired_central,
                  p_gatt->att_mtu_desired_periph);
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t *p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
    }
}
/**@snippet [Handling the data received over BLE] */

/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the Health Thermometer, Battery and Device Information services.
 */
static void services_init(void)
{
    ret_code_t err_code;
    ble_dis_init_t dis_init;
    nrf_ble_qwr_init_t qwr_init = {0};
    ble_dis_sys_id_t sys_id;
    ble_nus_init_t nus_init;

